nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxn947/edgefast_bluetooth_examples/central_ipsp/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPinsWifi
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPinsWifi(void)
{
#if defined(WIFI_IW610_BOARD_MURATA_2LL_M2)
    /* Enables the clock for GPIO0: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio0);
#endif
    /* Enables the clock for GPIO1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Gpio1);
#if defined(WIFI_IW610_BOARD_MURATA_2LL_M2)
    /* Enables the clock for PORT0: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port0);
#endif
    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);

    gpio_pin_config_t WL_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /*
     * Initialize GPIO functionality on WL_RST
     * - WIFI_IW610_BOARD_MURATA_2LL_M2, PORT0_28 (pin E8) is configured as PIO0_28
     * - Other boards, PORT1_21 (pin L5) is configured as PIO1_21
     */
    GPIO_PinInit(BOARD_INITPINSWIFI_WL_RST_GPIO, BOARD_INITPINSWIFI_WL_RST_PIN, &WL_RST_config);

    /*
     * Configures pin muxing of WL_RST
     * - WIFI_IW610_BOARD_MURATA_2LL_M2, PORT0_28 (pin E8) is configured as PIO0_28
     * - Other boards, PORT1_21 (pin L5) is configured as PIO1_21
     */
    PORT_SetPinMux(BOARD_INITPINSWIFI_WL_RST_PORT, BOARD_INITPINSWIFI_WL_RST_PIN, kPORT_MuxAlt0);

    BOARD_INITPINSWIFI_WL_RST_PORT->PCR[BOARD_INITPINSWIFI_WL_RST_PIN] =
        ((BOARD_INITPINSWIFI_WL_RST_PORT->PCR[BOARD_INITPINSWIFI_WL_RST_PIN] &
         /* Mask bits to zero which are setting */
         (~(PORT_PCR_IBE_MASK)))

         /* Input Buffer Enable: Enables. */
         | PORT_PCR_IBE(PCR_IBE_ibe1));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
